app/views/articles/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
        <% @articles.each do |article| %>
        <% @user = User.find(article.user_id) %>